-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 26, 2023 at 08:17 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `university_map`
--

-- --------------------------------------------------------

--
-- Table structure for table `facilities`
--

DROP TABLE IF EXISTS `facilities`;
CREATE TABLE `facilities` (
  `number` int(2) NOT NULL,
  `name` varchar(100) NOT NULL,
  `additional-info` varchar(250) NOT NULL,
  `open` varchar(50) NOT NULL,
  `close` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `facilities`
--

INSERT INTO `facilities` (`number`, `name`, `additional-info`, `open`, `close`) VALUES
(1, 'عمادة شؤون الطلاب / النادي الرياضي', 'يتم اصدار البطاقة الجامعية هنا..كما يوجد نادي رياضي', '8', '22'),
(2, 'القاعه الكبرى', 'يكون فيها استضافه العديد من الاحداث مثل المؤتمرات ..استعراض مشاريع التخرج', '8', '15'),
(3, 'القاعة الصغرى', 'يتم استضافة بعض الانشطة والدورات فيها', '8', '15'),
(4, 'ادارة الجامعة', 'يتضمن مكتب رئيس الجامعة والادارة العليا بالجامعة', '8', '15'),
(5, 'قاعات ومكاتب هيئة التدريس ', 'يتم فيه عمل الاختبارات الورقية المقدمة من المركز الوطني للقياس مثل القدرات والتحصيلي', '8', '15'),
(6, 'المسبح', 'لايوجد', '8', '15'),
(7, 'مستودع التشغيل والصيانة ', 'لايوجد', '8', '15'),
(8, 'المكتبة المركزية ', 'يوجد فيها العديد من الخدمات لمنسوبي الجامعة مثل حجز الغرف للدراسة و الاجتماعات او استخدام اجهزة الحاسب المتوفرة للجميع', '8', '15'),
(9, 'كلية الهندسة للمعلمات', 'وفيها بعض المكاتب للمعلمات في كلية الهندسة ', '8', '15'),
(10, 'المسجد', 'يعتبر المسجد الاصغر في الجامعة', '8', '22'),
(11, 'قسم الهندسة الصناعية', 'لايوجد', '8', '15'),
(12, 'ادارة الامن الجامعي', 'لايوجد', '8', '15'),
(13, 'قسم الهندسة الميكانيكية ', 'لايوجد', '8', '15'),
(14, 'معامل كلية الهندسة', 'لايوجد', '8', '15'),
(15, 'معامل كلية الهندسة', 'لايوجد', '8', '15'),
(16, 'معامل كلية الهندسة', 'لايوجد', '8', '15'),
(17, 'معامل كلية الهندسة', 'لايوجد', '8', '15'),
(18, 'معامل كلية الهندسة', 'لايوجد', '8', '15'),
(19, 'مركز البحوث والاستشارات', 'لايوجد', '8', '15'),
(20, 'ادارة الشبكة الهاتفية والاعلام', 'لايوجد', '8', '15'),
(21, 'ادارة الصيانة والتشغيل', 'لايوجد', '8', '15'),
(22, 'قاعات ومكاتب ومعامل كلية الهندسة', 'لايوجد', '8', '15'),
(23, 'معمل الهندسة الوطنية ', 'لايوجد', '8', '15'),
(24, 'كلية المجتمع', 'لايوجد', '8', '15'),
(25, 'عمادة القبول والتسجيل', 'عمادة القبول مسؤولة عن تسجيل المستجدين في الجامعة او التحويل بين التخصصات', '8', '15'),
(26, 'عمادة تقنية المعلومات', 'تعتبر المسؤولة عن الخدمات الالكترونية داخل الجامعة مثل الايميل الجامعي وشبكة الانترنت داخل الحرم الجامعي', '8', '15'),
(27, 'عمادة الدراسات المساندة ', 'وفيها عمادة خدمة المجتمع والتنمية المستدامة، ومركز الابتكار وريادة الاعمال', '8', '15'),
(28, 'الادارات المساندة', 'لايوجد', '8', '15'),
(29, 'قاعات دراسية', 'لايوجد', '8', '15'),
(30, 'ادارة المشاريع والصيانة', 'لايوجد', '8', '15'),
(31, 'كلية الشريعة والانظمة', 'وفيها مكاتب اعضاء هئية التدريس في كلية الشريعة', '8', '15'),
(32, 'كلية ادارة الاعمال', 'لايوجد', '8', '15'),
(33, 'المطعم الجامعي', 'يتوفر فيه وجبات الفطور الى قبل اذان الظهر ب 30 دقيقة، ووجبات الغداء بعد صلاة الظهر', '8', '15'),
(34, 'الجامع الكبير', 'يعتبر المسجد الرئيسي في الجامعة', '8', '22'),
(35, 'قاعات دراسية ومكاتب', 'فيه مكاتب لبعض معلمين كلية العلوم مثل قسم الرياضيات، كما يوجد قرطاسية فالدور الثاني', '8', '15'),
(36, 'مبنى وكالات الجامعة', 'لايوجد', '8', '15'),
(37, 'كلية العلوم', 'لايوجد', '8', '15'),
(38, 'معامل كلية العلوم', 'لايوجد', '8', '15'),
(39, 'معامل كلية العلوم', 'لايوجد', '8', '15'),
(40, 'مبنى العمادات المساندة', 'لايوجد', '8', '15'),
(41, 'الادارة الطبية', 'يعتبر المستوصف او المشفى داخل الجامعة لجميع المنسوبين', '8', '15'),
(42, 'كلية الحاسبات وتقنية المعلومات', 'فيها جميع مكاتب اعضاء هيئة التدريس في كلية الحاسبات بجميع اقسامها', '8', '15'),
(43, 'المعشبة', 'لايوجد', '8', '15'),
(44, 'مبنى اصدار تصاريح الدخول', 'يتم من خلاله اصدار التصاريح للدخول داخل الجامعة بالسيارة للمتفوقين وذوي الاحتياجات الخاصة', '8', '15'),
(45, 'عمادة البحث العلمي', 'لايوجد', '8', '15'),
(46, 'معامل كلية الحاسبات وتقنية المعلومات', 'يكون فيها بعض الاختبارات الحضورية في البلاك بورد', '8', '15'),
(47, 'ادارة المستودعات', 'لايوجد', '8', '15'),
(48, 'المجهر الالكتروني', 'لايوجد', '8', '15');

-- --------------------------------------------------------

--
-- Table structure for table `gates`
--

DROP TABLE IF EXISTS `gates`;
CREATE TABLE `gates` (
  `number` int(1) NOT NULL,
  `street` varchar(50) NOT NULL,
  `open` int(2) NOT NULL,
  `close` int(2) NOT NULL,
  `additional-info` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `gates`
--

INSERT INTO `gates` (`number`, `street`, `open`, `close`, `additional-info`) VALUES
(1, 'الستين', 8, 22, 'تعتبر البوابة الرئيسية، يتم اغلاق دخول وخروج السيارات منها الساعة 3 عصراً'),
(2, 'طريق المطار', 8, 22, 'هي البوابة الموجودة على الطريق السريع وتبقى بوابة السيارات حتى الساعة 10 مساءً'),
(3, '', 8, 15, 'البوابة مخصصة لمعلمات كلية الهندسة '),
(4, '', 8, 20, 'قد يختلف موعد اغلاق البوابة بحسب عدد السيارات اللي توقف عندها'),
(5, '', 8, 18, 'قد يختلف موعد اغلاق البوابة بحسب عدد السيارات اللي توقف عندها'),
(6, 'محمد بن عبدالعزيز', 8, 15, '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `facilities`
--
ALTER TABLE `facilities`
  ADD PRIMARY KEY (`number`);

--
-- Indexes for table `gates`
--
ALTER TABLE `gates`
  ADD PRIMARY KEY (`number`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
